{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.5.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 99], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_input"}}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, 99], "dtype": "float32", "input_dim": 10000, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 99}}, {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 99, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 99, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 10000, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "dense/kernel", "shape": [99, 500], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -1.3576001881734543, "scale": 3.9951743273401436e-05, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [500], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -1.191469430923462, "scale": 1.799629844439205e-05, "original_dtype": "float32"}}, {"name": "dense_1/kernel", "shape": [500, 10000], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -3.56809404238307, "scale": 6.389166712715449e-05, "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [10000], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.22743965070016817, "scale": 6.080623748801416e-06, "original_dtype": "float32"}}, {"name": "embedding/embeddings", "shape": [10000, 50], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.9349325143282279, "scale": 2.5344479772512886e-05, "original_dtype": "float32"}}, {"name": "gru/gru_cell/kernel", "shape": [50, 297], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -2.41808776988257, "scale": 6.756511134378077e-05, "original_dtype": "float32"}}, {"name": "gru/gru_cell/recurrent_kernel", "shape": [99, 297], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -1.1404919963975497, "scale": 3.527549399639819e-05, "original_dtype": "float32"}}, {"name": "gru/gru_cell/bias", "shape": [297], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -1.2261220034608362, "scale": 2.1538875091537017e-05, "original_dtype": "float32"}}, {"name": "gru_1/gru_cell_1/kernel", "shape": [99, 297], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -2.894079096177045, "scale": 7.874830878553088e-05, "original_dtype": "float32"}}, {"name": "gru_1/gru_cell_1/recurrent_kernel", "shape": [99, 297], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -1.1184292759349255, "scale": 3.407663617607402e-05, "original_dtype": "float32"}}, {"name": "gru_1/gru_cell_1/bias", "shape": [297], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -1.1011394171544886, "scale": 2.8701666027746347e-05, "original_dtype": "float32"}}]}]}